       IDENTIFICATION DIVISION.
       PROGRAM-ID. ANAGRAM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SUBJECT PIC X(20).
       01 WS-CANDIDATES-COUNT PIC 9.
       01 WS-CANDIDATES-TABLE.
       02 WS-CANDIDATES OCCURS 1 TO 20
       DEPENDING ON WS-CANDIDATES-COUNT.
       05 WS-CANDIDATE PIC X(20).
       01 WS-RESULT-LIST PIC X(48).
       01 WS-I PIC 9.
       01 WS-J PIC 99.
       01 WS-WORD-CANDIDATE PIC X(20).
       01 WS-TALLY-LETTER PIC X.
       01 WS-TALLY-1 PIC 99.
       01 WS-TALLY-2 PIC 99.
       01 WS-TALLY-EQ PIC 99.
       01 WS-COMMA PIC 9 VALUE 0.

       PROCEDURE DIVISION.

       CHECK-ANAGRAM.
       MOVE FUNCTION UPPER-CASE (WS-CANDIDATES(WS-I))
          TO WS-WORD-CANDIDATE.
       IF WS-WORD-CANDIDATE = WS-SUBJECT THEN
          EXIT PARAGRAPH.
       MOVE 0 TO WS-TALLY-EQ.
       PERFORM TALLY-LETTER VARYING WS-J FROM 1 BY 1
          UNTIL WS-J>20.
       IF WS-TALLY-EQ = 20 THEN
          IF WS-COMMA = 1 THEN
             STRING WS-RESULT-LIST DELIMITED BY SPACE
                "," DELIMITED BY SIZE
                INTO WS-RESULT-LIST
          END-IF
          
          MOVE 1 TO WS-COMMA
          STRING WS-RESULT-LIST DELIMITED BY SPACE
             WS-CANDIDATES(WS-I) DELIMITED BY SPACE
             INTO WS-RESULT-LIST
       END-IF.

       TALLY-LETTER.
       MOVE WS-SUBJECT(WS-J:1) TO WS-TALLY-LETTER.
       MOVE 0 TO WS-TALLY-1.
       MOVE 0 TO WS-TALLY-2.
       INSPECT WS-SUBJECT TALLYING WS-TALLY-1 FOR ALL WS-TALLY-LETTER.
       INSPECT WS-WORD-CANDIDATE TALLYING WS-TALLY-2
          FOR ALL WS-TALLY-LETTER.
       IF WS-TALLY-1 = WS-TALLY-2 THEN
          ADD 1 TO WS-TALLY-EQ.

       FIND-ANAGRAMS.
       MOVE "" TO WS-RESULT-LIST.
       MOVE 0 TO WS-COMMA.
       MOVE FUNCTION UPPER-CASE (WS-SUBJECT) TO WS-SUBJECT.
       PERFORM CHECK-ANAGRAM VARYING WS-I FROM 1 BY 1
               UNTIL WS-I>WS-CANDIDATES-COUNT.
